import random
Words = ['АГЕНТ', 'АКТ', 'АКЦИЯ', 'АЛЬБОМ', 'АМФИБИЯ', 'АППАРАТ', 'БАБОЧКА', 'БАЗА', 'БАНК', 'БАНЯ', 'БАР', 'БАРЬЕР', 'БАССЕЙН', 'БАТАРЕЯ', 'БАШНЯ', 'БЕЛОК', 'БЕРЁЗА', 'БИЛЕТ', 'БИРЖА',
         'БЛОК', 'БОБ', 'БОЕВИК', 'БОЛЬНИЦА', 'БОМБА', 'БОРТ', 'БОТИНОК', 'БОЧКА', 'БРАК', 'БУМАГА', 'БУТЫЛКА', 'БЫК', 'БЫЧОК', 'БЮСТ', 'ВАЛ', 'ВЕДЬМА', 'ВЕНЕЦ', 'ВЕРТОЛЁТ', 'ВЕРФЬ', 'ВЕТЕР',
         'ВИЛКА', 'ВИРУС', 'ВИСКИ', 'ВОДА', 'ВОЖДЬ', 'ВОЛНА', 'ВОР', 'ВОРОТ', 'ГАЗ', 'ГАЗЕЛЬ', 'ГАЛОП', 'ГВОЗДЬ', 'ГИГАНТ', 'ГОЛОВА', 'ГОЛЬФ', 'ГРАНАТ', 'ГРЕБЕНЬ', 'ГРИФ', 'ГРУША', 'ГУБА',
         'ГУСЕНИЦА', 'ДАМА', 'ДАЧА', 'ДВОР', 'ДВОРНИК', 'ДИСК', 'ДОЛГ', 'ДРАКОН', 'ДРОБЬ', 'ДЫРА', 'ЕДИНОРОГ', 'ЖИЛА', 'ЗАБОР', 'ЗАВОД', 'ЗАЛИВ', 'ЗАМОК', 'ЗАЯЦ', 'ЗВЕЗДА', 'ЗЕБРА', 'ЗЕМЛЯ',
         'ЗМЕЙ', 'ЗОЛОТО', 'ЗОНА', 'ИГЛА', 'ИКРА', 'ИНСТИТУТ', 'КАБАЧОК', 'КАБИНЕТ', 'КАДР', 'КАЗИНО', 'КАМЕНЬ', 'КАМЕРА', 'КАНАЛ', 'КАРАУЛ', 'КАРЛИК', 'КАРТА', 'КАТОК', 'КАША', 'КЕНГУРУ',
         'КЕНТАВР', 'КЕТЧУП', 'КИВИ', 'КИСТЬ', 'КИТ', 'КЛАСС', 'КЛЕТКА', 'КЛЮЧ', 'КОЛ', 'КОЛОДА', 'КОЛОННА', 'КОЛЬЦО', 'КОРЕНЬ', 'КОРОЛЕВА', 'КОРОЛЬ', 'КОРОНА', 'КОСА', 'КОСЯК', 'КОШКА',
         'КРАН', 'КРЕПОСТЬ', 'КРОЛИК', 'КРОНА', 'КРОШКА', 'КРУГ', 'КРЫЛО', 'КУЛАК', 'КУРС', 'ЛАДЬЯ', 'ЛАЗЕР', 'ЛАМА', 'ЛАСКА', 'ЛЕВ', 'ЛЕГЕНДА', 'ЛЁД', 'ЛЕС', 'ЛИМУЗИН', 'ЛИНИЯ', 'ЛИПА',
         'ЛИРА', 'ЛИЦО', 'ЛОЖЕ', 'ЛОПАТКА', 'ЛОТ', 'ЛОШАДЬ', 'ЛУК', 'МАНДАРИН', 'МАРКА', 'МАРШ', 'МАСЛО', 'МАТ', 'МЕДВЕДЬ', 'МИКРОСКОП', 'МИНА', 'МИР', 'МОЛНИЯ', 'МОЛЬ', 'МОРКОВЬ', 'МОТИВ',
         'МУШКА', 'НАЛЁТ', 'НАРЯД', 'НЕБОСКРЁБ', 'НОМЕР', 'НОРКА', 'НОТА', 'НЯНЯ', 'ОБЛОМ', 'ОБРАЗОВАНИЕ', 'ОБРЕЗ', 'ОВСЯНКА', 'ОЛИМП', 'ОПЕРА', 'ОРГАН', 'ОРДЕН', 'ОРЁЛ', 'ОСЬМИНОГ', 'ОЧКИ',
         'ПАДЕНИЕ', 'ПАНАМА', 'ПАРА', 'ПАРАШЮТ', 'ПАРК', 'ПАРТИЯ', 'ПАТРОН', 'ПАУК', 'ПЕРЕВОД', 'ПЕРО', 'ПЕЧАТЬ', 'ПИЛОТ', 'ПИРАТ', 'ПИСТОЛЕТ', 'ПЛАТА', 'ПЛАТЬЕ', 'ПЛОМБА', 'ПЛОЩАДЬ', 'ПОВАР',
         'ПОГОН', 'ПОДКОВА', 'ПОДЪЁМ', 'ПОЛ', 'ПОЛЕ', 'ПОМПА', 'ПОРТ', 'ПОСОЛ', 'ПОСТ', 'ПОТОК', 'ПОЧКА', 'ПРАВО', 'ПРЕДЛОЖЕНИЕ', 'ПРИЗРАК', 'ПРИНЦЕССА', 'ПРИШЕЛЕЦ', 'ПРОБКА', 'ПРОВОДНИК',
         'ПРОКАТ', 'ПРОСПЕКТ', 'ПУТЬ', 'ПУШКИН', 'ПЯТАЧОК', 'РАЗВОД', 'РАЗВОРОТ', 'РАЗРЯД', 'РАСТВОР', 'РИФ', 'РОБОТ', 'РОГ', 'РОД', 'РОК', 'РУБАШКА', 'РУБКА', 'РУЛЕТКА', 'РУЧКА', 'РЫБА',
         'РЫСЬ', 'РЫЦАРЬ', 'САЛЮТ', 'САНТЕХНИК', 'САЧОК', 'СВЕЧА', 'СВИДЕТЕЛЬ', 'СЕКРЕТ', 'СЕТЬ', 'СКАТ', 'СНАРЯД', 'СНЕГ', 'СНЕГОВИК', 'СОБАКА', 'СОЛДАТ', 'СОЛЬ', 'СПЛАВ', 'СПУТНИК', 'ССЫЛКА',
         'СТАВКА', 'СТАДИОН', 'СТАНОК', 'СТВОЛ', 'СТЕКЛО', 'СТЕНА', 'СТОЛ', 'СТОПКА', 'СТРЕЛА', 'СТРОЧКА', 'СТРУНА', 'СТУЛ', 'СЪЕЗД', 'ТАЗ', 'ТАКСА', 'ТАКТ', 'ТАНЕЦ', 'ТАРЕЛКА', 'ТЕЛЕГА',
         'ТЕЛЕСКОП', 'ТИТАН', 'ТОК', 'ТРЕУГОЛЬНИК', 'ТРУБА', 'ТУР', 'УДАРНИК', 'УЗЕЛ', 'УТКА', 'УЧЁНЫЙ', 'УЧИТЕЛЬ', 'ФАКЕЛ', 'ФАЛАНГА', 'ФИНКА', 'ФЛЕЙТА', 'ХЛОПОК', 'ЦИЛИНДР', 'ЧЕСТЬ', 'ШАЙБА',
         'ШАЙКА', 'ШАР', 'ШАХ', 'ШАШКА', 'ШИШКА', 'ШОКОЛАД', 'ШПАГАТ', 'ШПИОН', 'ШУБА', 'ЭЛЬФ', 'ЯБЛОКО', 'ЯЗЫК', 'ЯЧМЕНЬ']

def generate_teams(coin, player_list):
    blue_team = []
    red_team = []
    i = 0
    while i < len(player_list):
        random_int = random.randint(0, len(player_list)-1)
        print('first cycle')
        while blue_team.count(player_list[random_int]) != 0 or red_team.count(player_list[random_int]) != 0:
            print('second cycle')
            random_int = random.randint(0, len(player_list)-1)
        blue_team.append(player_list[random_int])
        i = i + 1
        if i != len(player_list):
            random_int = random.randint(0, len(player_list)-1)
            while red_team.count(player_list[random_int]) != 0 or blue_team.count(player_list[random_int]) != 0:
                random_int = random.randint(0, len(player_list)-1)
                print('third cycle')
            red_team.append(player_list[random_int])
            i = i + 1
    blue_cap_num = random.randint(0, len(blue_team)-1)
    red_cap_num = random.randint(0, len(red_team)-1)
    blue_team_wo_cap = blue_team.copy()
    blue_team_wo_cap.remove(blue_team[blue_cap_num])
    red_team_wo_cap = red_team.copy()
    red_team_wo_cap.remove(red_team[red_cap_num])
    return blue_team, red_team, blue_cap_num, red_cap_num, blue_team_wo_cap, red_team_wo_cap
